app/controllers/portfolios_controller.rb

  def sell
    @the_user = current_user
    @the_user_id = @the_user.id
    @exch = params[:exchange]
    @sym = params[:symbol]
    @stock = get_stock(@exch, @sym)
    @qty = params[:qty]
    @stockholding = Portfolio.find_by_user_id_and_stock_id(@the_user.id,@stock.id)
    @stockholding.quantity -= @qty.to_i
    @stockholding.save!
---
UPDATE "portfolios" SET "updated_at" = '2010-07-16 17:19:27', "quantity" = -95 WHERE "id" = 1