app/controllers/portfolios_controller.rb

  def list
    @the_user = current_user
    @member_name = params[:member]
    @authorized = current_user && (!@member_name || current_user.username == @member_name)
    @member_name ||= @the_user.username
    @member = User.find_by_username(@member_name)

    @x = Portfolio.find(:all, :conditions => ["user_id= ?", @member.id])
---
SELECT * FROM "users" WHERE ("users"."username" = 'tim') LIMIT 1
SELECT * FROM "portfolios" WHERE (user_id= 1)
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def buy
    @the_user = current_user
    @the_user_id = @the_user.id
    @exch = params[:exchange]
    @sym = params[:symbol]
    @quote = get_stock_quote(  @sym)
    @ask = ( @quote[1]).to_f
    @stock = get_stock(@exch, @sym)
    @qty = params[:qty]
    @stockholding = Portfolio.find_by_user_id_and_stock_id(@the_user.id,@stock.id)
    if (@stockholding==nil)
      @stockholding = Portfolio.new(:user_id => @the_user.id, :stock_id => @stock.id, :quantity => 0)
      @stockholding.save
---
SELECT * FROM "portfolios" WHERE ("portfolios"."user_id" = 2 AND "portfolios"."stock_id" = 1) LIMIT 1
INSERT INTO "portfolios" ("created_at", "quantity", "updated_at", "user_id", "stock_id") VALUES('2010-07-09 20:30:24', 0, '2010-07-09 20:30:24', 2, 1)
INSERT INTO "stocks" ("company", "created_at", "updated_at", "exchange") VALUES('$USD', '2010-07-16 21:10:02', '2010-07-16 21:10:02', 'CURRENCY')
UPDATE "portfolios" SET "updated_at" = '2010-07-16 21:59:36', "quantity" = -359950 WHERE "id" = 2

  def sell
    @the_user = current_user
    @the_user_id = @the_user.id
    @exch = params[:exchange]
    @sym = params[:symbol]
    @quote = get_stock_quote(  @sym)
    @bid = ( @quote[2]).to_f
    @stock = get_stock(@exch, @sym)
    @qty = params[:qty]
    @stockholding = Portfolio.find_by_user_id_and_stock_id(@the_user.id,@stock.id)
---
SELECT * FROM "portfolios" WHERE ("portfolios"."user_id" = 1 AND "portfolios"."stock_id" = 1) LIMIT 1

  def index
    @portfolios = Portfolio.all
---
SELECT * FROM "portfolios"

  def show
    @portfolio = Portfolio.find(params[:id])
---
SELECT * FROM "portfolios" WHERE ("portfolios"."id" = 1)

  def create
    @portfolio = Portfolio.new(params[:portfolio])

    respond_to do |format|
      if @portfolio.save
---
INSERT INTO "portfolios" ("created_at", "quantity", "updated_at", "user_id", "stock_id") VALUES('2010-07-08 18:52:06', 5, '2010-07-08 18:52:06', 0, 0)

  def destroy
    @portfolio = Portfolio.find(params[:id])
    @portfolio.destroy
---
SELECT * FROM "portfolios" WHERE ("portfolios"."id" = 1)
DELETE FROM "portfolios" WHERE "id" = 1