app/controllers/stocks_controller.rb

SELECT * FROM "stocks"
---
  def index
    @stocks = Stock.all

SELECT * FROM "stocks" WHERE ("stocks"."id" = 1)
---
  def show
    @stock = Stock.find(params[:id])

SELECT * FROM "stocks" WHERE ("stocks"."id" = 1)
---
  def edit
    @stock = Stock.find(params[:id])

INSERT INTO "stocks" ("company", "created_at", "updated_at", "exchange") VALUES('ibm', '2010-07-02 16:28:01', '2010-07-02 16:28:01', 'nyse')
---
  def create
    @stock = Stock.new(params[:stock])

    respond_to do |format|
      if @stock.save

SELECT * FROM "stocks" WHERE ("stocks"."id" = 1)
UPDATE "stocks" SET "updated_at" = '2010-07-08 18:49:52', "exchange" = 'NYSE' WHERE "id" = 1
---
  def update
    @stock = Stock.find(params[:id])

    respond_to do |format|
      if @stock.update_attributes(params[:stock])