app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.current_value = 100000;
    @user.lattitude = 42367000
    @user.longitude = -71259000
    Portfolio.new(:user_id => @user.id, :stock_id => 1, :quantity => 100000).save! ;
---
INSERT INTO "portfolios" ("created_at", "quantity", "updated_at", "user_id", "stock_id") VALUES('2010-07-16 21:02:32', 100000, '2010-07-16 21:02:32', NULL, 1)
INSERT INTO "users" ("lattitude", "created_at", "current_value", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "longitude", "email") VALUES(NULL, '2010-07-16 21:01:06', NULL, 'a47a7acc8d6f7ab1d5bee5d3628c49ef3c0088734d33753dc71cd0cbbd3be4fb7322c69483e2e0b4db932ccaaa509ac9da7c17bc4b06238522dfe5f7da4b89c5', '2010-07-16 21:01:06', 'tim', 'lpEn_r65IwjEAPfAHiFk', '4c1510d58a4ee4ada0491eb0a17e55450790dbeb65492e5756767a0e24c6109bddc5e63ce4b0529559df76042956900c62f5ef9e9e790f6c75898c1e69aa4966', NULL, 'tjhickey@brandeis.edu')

  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2010-07-02 18:08:25', "username" = 'tjhickey' WHERE "id" = 1

  def set_location
    @user = User.find_by_username(params[:u])
    @user.lattitude = params[:lat]
    @user.longitude = params[:lon]
    @user.save!
---
SELECT "users".id FROM "users" WHERE (LOWER("users"."username") = 'tjhickey' AND "users".id <> 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-07-13 17:13:06', "longitude" = -71200000, "lattitude" = 41100000 WHERE "id" = 2

  def get_locations
    @users = User.find(:all)
    @userlocs  = @users.collect do |u|
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "users"